---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricTagComponentReference
source: html/1dfce1e3-f3df-b4e1-e87a-675c6a3240c9.htm
---
# Autodesk.Revit.DB.Structure.FabricTagComponentReference

How FabricSheet tag text will be aligned to the FabricSheet symbol.

## Syntax (C#)
```csharp
public enum FabricTagComponentReference
```